#+startup: fold
* DONE 备份前置参数，包括pm产品
:PROPERTIES:
:ID:       1a142d66-c7cf-42b8-aa98-a48b6a4b9b9b
:PARENT_ID: ba65d25f-ef94-4d6b-8fcc-6b39d0a9ba3d
:END:
* DONE 回收由于313改为2导致没有路由的单子
:PROPERTIES:
:ID:       9fbb9b9f-5be3-4596-bdb5-9e69f354691d
:PARENT_ID: ba65d25f-ef94-4d6b-8fcc-6b39d0a9ba3d
:END:
* DONE 回退前置 groupMember 错单
:PROPERTIES:
:ID:       b2862f34-56c2-40f9-a6f8-5a5727dda00f
:PARENT_ID: ba65d25f-ef94-4d6b-8fcc-6b39d0a9ba3d
:END:
* DONE 对账环境前置工单创建及用户赋权（写脚本）
CLOSED: [2022-04-05 Tue 18:11] SCHEDULED: <2022-04-05 Tue>
:PROPERTIES:
:ID:       59dd169d-cbaf-4e41-9497-8d09c4609c05
:PARENT_ID: ba65d25f-ef94-4d6b-8fcc-6b39d0a9ba3d
:END:
:LOGBOOK:
CLOCK: [2022-04-05 Tue 16:57]--[2022-04-05 Tue 18:11] =>  1:14
:END:
* DONE 对账环境前置数据源问题核查及修改
CLOSED: [2022-04-05 Tue 16:54] SCHEDULED: <2022-04-05 Tue>
:PROPERTIES:
:ID:       2400f718-f8e0-4681-9aa3-4af60d28c271
:PARENT_ID: ba65d25f-ef94-4d6b-8fcc-6b39d0a9ba3d
:END:
低级错误，acct3连接串中多打了一个@符号。
* DONE 批量更新信管svn前置工单建表语句（写脚本）
CLOSED: [2022-04-05 Tue 19:56]
:PROPERTIES:
:ID:       b0863d29-b54c-4eee-b6e4-1c4760d17e4b
:PARENT_ID: ba65d25f-ef94-4d6b-8fcc-6b39d0a9ba3d
:END:
:LOGBOOK:
CLOCK: [2022-04-05 Tue 19:36]--[2022-04-05 Tue 19:56] =>  0:20
CLOCK: [2022-04-05 Tue 19:20]--[2022-04-05 Tue 19:35] =>  0:15
:END:
* DONE 对账环境新建异动工单表，svn建表语句移到稽核目录下
CLOSED: [2022-04-05 Tue 20:33]
:PROPERTIES:
:ID:       b8fbd1af-d517-4aa6-b2fc-a2e039ae88c9
:PARENT_ID: ba65d25f-ef94-4d6b-8fcc-6b39d0a9ba3d
:END:
* DONE 对账环境异动应用问题解决
CLOSED: [2022-04-07 Thu 11:36]
:PROPERTIES:
:ID:       7618d2d3-acfe-43de-a113-da9abc177ad2
:PARENT_ID: ba65d25f-ef94-4d6b-8fcc-6b39d0a9ba3d
:END:
:LOGBOOK:
- State "NEXT"       from "WAITING"    [2022-04-07 Thu 11:32]
CLOCK: [2022-04-07 Thu 11:32]--[2022-04-07 Thu 11:36] =>  0:04
- State "WAITING"    from "TODO"       [2022-04-06 Wed 11:37] \\
  to xuxiang
:END:
* DONE 生产100主机上发布脚本部署到测试和对账环境
CLOSED: [2022-04-06 Wed 15:43]
:PROPERTIES:
:ID:       6284ea06-1f33-4ba4-8fe7-a5ac585dae75
:PARENT_ID: ba65d25f-ef94-4d6b-8fcc-6b39d0a9ba3d
:END:
:LOGBOOK:
CLOCK: [2022-04-06 Wed 13:06]--[2022-04-06 Wed 13:29] =>  0:23
CLOCK: [2022-04-06 Wed 12:11]--[2022-04-06 Wed 12:20] =>  0:09
CLOCK: [2022-04-06 Wed 11:38]--[2022-04-06 Wed 12:01] =>  0:23
:END:
* DONE 更新测试环境所有jar包和配置
CLOSED: [2022-04-06 Wed 16:10]
:PROPERTIES:
:ID:       94bc3e7a-54fb-4c36-a80b-ece5b8988e4f
:PARENT_ID: ba65d25f-ef94-4d6b-8fcc-6b39d0a9ba3d
:END:
稽核包未更新
* DONE 测试环境搭建：工单表/前置应用
CLOSED: [2022-04-06 Wed 17:13]
:PROPERTIES:
:ID:       69ca4133-c8b8-4c71-9815-b8634200943c
:PARENT_ID: ba65d25f-ef94-4d6b-8fcc-6b39d0a9ba3d
:END:
  :LOGBOOK:
  CLOCK: [2022-04-05 Tue 20:47]--[2022-04-05 Tue 21:00] =>  0:13
  :END:
* TODO 1.2 操作系统上的程序(什么是程序和编译器)
:PROPERTIES:
:PARENT_ID: NJU-2022-OS
:ID:       46389b2f-d306-4832-acb9-651749daa22d
:END:
* TODO 1.3 多处理器编程(线程库、现代处理器和宽松内存模型)
:PROPERTIES:
:PARENT_ID: NJU-2022-OS
:ID:       b639a91e-1a04-4ece-b03a-1e5c854903df
:END:

* DONE 没有ID属性的entry设置child时，自动添加ID属性
CLOSED: [2022-05-01 Sun 11:58]
:PROPERTIES:
:PARENT_ID: 5103290c-1e80-4095-97d6-da034ec032ef
:ID:       427af989-3139-4e96-adde-6ce105403c55
:END:
:LOGBOOK:
CLOCK: [2022-05-01 Sun 11:30]--[2022-05-01 Sun 11:58] =>  0:28
:END:
* DONE 解决有PARENT_ID属性，没有ID属性的entry在项目树中不展示的问题
CLOSED: [2022-05-01 Sun 15:58]
:PROPERTIES:
:PARENT_ID: 5103290c-1e80-4095-97d6-da034ec032ef
:ID:       bc90b665-ede4-4e61-98cb-a7d9923d24cc
:END:
:LOGBOOK:
CLOCK: [2022-05-01 Sun 15:39]--[2022-05-01 Sun 15:58] =>  0:19
CLOCK: [2022-05-01 Sun 12:43]--[2022-05-01 Sun 13:50] =>  1:07
:END:
* DONE 没有PARENT的entry，展示在default下
CLOSED: [2022-05-04 Wed 16:31]
:PROPERTIES:
:PARENT_ID: 5103290c-1e80-4095-97d6-da034ec032ef
:ID:       aafb8263-47db-4f31-b919-7ce46246bfc3
:END:
* DONE 项目视图功能：跳转到文件中的entry(按键RET)
CLOSED: [2022-05-04 Wed 16:30]
:PROPERTIES:
:ID:       02889ae0-fcce-4f52-9527-c3cc92805c32
:PARENT_ID: 5103290c-1e80-4095-97d6-da034ec032ef
:END:
:LOGBOOK:
CLOCK: [2022-05-03 Tue 15:36]--[2022-05-03 Tue 16:09] =>  0:33
:END:
* DONE 项目视图功能：增加任务状态
CLOSED: [2022-05-04 Wed 09:37]
:PROPERTIES:
:ID:       b0e710be-000f-4b10-bf5a-d40fd78ee7d1
:PARENT_ID: 5103290c-1e80-4095-97d6-da034ec032ef
:END:
:LOGBOOK:
CLOCK: [2022-05-04 Wed 09:22]--[2022-05-04 Wed 09:37] =>  0:15
CLOCK: [2022-05-03 Tue 16:10]--[2022-05-03 Tue 16:57] =>  0:47
:END:
* DONE 项目视图功能：任务计时和停止(按键I/O)
CLOSED: [2022-05-07 Sat 11:08]
:PROPERTIES:
:ID:       30964573-a057-49ac-b18b-1ae15e0bb303
:PARENT_ID: 5103290c-1e80-4095-97d6-da034ec032ef
:END:
:LOGBOOK:
CLOCK: [2022-05-04 Wed 16:25]--[2022-05-04 Wed 16:28] =>  0:03
CLOCK: [2022-05-04 Wed 16:11]--[2022-05-04 Wed 16:24] =>  0:13
:END:
* NEXT 项目视图功能：显示隐藏已完成的task。
:PROPERTIES:
:ID:       16a11d39-7c9d-4905-b4bc-210f9718e641
:PARENT_ID: 5103290c-1e80-4095-97d6-da034ec032ef
:END:
:LOGBOOK:
CLOCK: [2022-05-05 Thu 17:36]--[2022-05-05 Thu 17:48] =>  0:12
:END:
* DONE 取昆明到长沙高铁报销凭证，提交4月差旅2.
CLOSED: [2022-05-07 Sat 11:21]
:PROPERTIES:
:ID:       6abfb928-7646-4477-84ab-c0c1539bf553
:END:
* DONE 项目功能视图：刷新时保存光标所在的entry位置
CLOSED: [2022-05-05 Thu 17:30]
:PROPERTIES:
:ID:       c07ce5e9-177d-49a8-b541-f0e67836deaa
:PARENT_ID: 5103290c-1e80-4095-97d6-da034ec032ef
:END:
* NEXT 通用视图功能：使用ewoc只更新有变动的部分
:PROPERTIES:
:ID:       593585f0-8c47-4413-a5fd-dbf9ca3f749d
:PARENT_ID: 5103290c-1e80-4095-97d6-da034ec032ef
:END:
:LOGBOOK:
CLOCK: [2022-05-08 Sun 13:28]--[2022-05-08 Sun 13:35] =>  0:07
CLOCK: [2022-05-07 Sat 23:43]--[2022-05-07 Sat 23:44] =>  0:01
:END:
* DONE 环境搭建：测试环境，代码依赖
CLOSED: [2022-05-07 Sat 11:40]
:PROPERTIES:
:ID:       7fe5188c-3df6-4321-a1c2-c1e06bd92932
:PARENT_ID: 2595c172-46a7-43ea-aaa4-dca146571f57
:END:
* DONE 项目视图功能：状态改变(td/tt)
CLOSED: [2022-05-06 Fri 15:04]
:PROPERTIES:
:ID:       5c5b182b-df8e-4d83-88f6-7dd92fbc40da
:PARENT_ID: 5103290c-1e80-4095-97d6-da034ec032ef
:END:
:LOGBOOK:
CLOCK: [2022-05-06 Fri 14:38]--[2022-05-06 Fri 15:04] =>  0:26
:END:
* DONE 项目视图功能：entry行任意位置操作（获取id）
CLOSED: [2022-05-06 Fri 16:28]
:PROPERTIES:
:ID:       dfd89357-4fef-4ab1-ab70-1561c9356e86
:PARENT_ID: 5103290c-1e80-4095-97d6-da034ec032ef
:END:
:LOGBOOK:
CLOCK: [2022-05-06 Fri 16:19]--[2022-05-06 Fri 16:28] =>  0:09
:END:
* DONE 项目视图功能：获取不到id的位置添加为默认项目
CLOSED: [2022-05-06 Fri 16:41]
:PROPERTIES:
:ID:       f002ff5e-0b8c-4ff5-b68e-51b7fb4fb1b2
:PARENT_ID: 5103290c-1e80-4095-97d6-da034ec032ef
:END:
:LOGBOOK:
CLOCK: [2022-05-06 Fri 16:29]--[2022-05-06 Fri 16:41] =>  0:12
:END:
- 默认项目的内容不属于重点需要关注的项目。
* DONE 项目视图功能：改变/设置父节点(按键c)
CLOSED: [2022-05-06 Fri 15:40]
:PROPERTIES:
:ID:       1707c210-063b-4c7b-86e1-1be210a85ef6
:PARENT_ID: 5103290c-1e80-4095-97d6-da034ec032ef
:END:
:LOGBOOK:
CLOCK: [2022-05-06 Fri 15:21]--[2022-05-06 Fri 15:40] =>  0:19
:END:
* DONE 买透气鞋子
CLOSED: [2022-05-07 Sat 10:13]
:PROPERTIES:
:ID:       0cebf4e5-5881-488a-912c-7d6b2c3674a5
:END:
* NEXT 项目视图功能：删除task(项目不允许删除，只能归档)
:PROPERTIES:
:ID:       29dcb6cd-12c3-483c-b1d2-a08873d59fa0
:PARENT_ID: 5103290c-1e80-4095-97d6-da034ec032ef
:END:
:LOGBOOK:
CLOCK: [2022-05-06 Fri 19:43]--[2022-05-06 Fri 20:34] =>  0:51
CLOCK: [2022-05-06 Fri 17:37]--[2022-05-06 Fri 18:03] =>  0:26
:END:
- 删除子节点
- 归档项目
* NEXT 项目视图功能：显示entry下的笔记
:PROPERTIES:
:ID:       38b2c5c5-58c3-4e62-95e2-6451b16670ce
:PARENT_ID: 5103290c-1e80-4095-97d6-da034ec032ef
:END:
* DONE 项目视图功能：entry重命名（考虑wdired方式）
CLOSED: [2022-05-07 Sat 10:12]
:PROPERTIES:
:ID:       5047a353-b94b-465d-88d7-0c214bfd4281
:PARENT_ID: 5103290c-1e80-4095-97d6-da034ec032ef
:END:
* DONE 项目视图功能：正在计时的entry高亮显示
CLOSED: [2022-05-07 Sat 10:58]
:PROPERTIES:
:ID:       d30bfcf2-1943-4a7c-b9bd-d82fcd01594c
:PARENT_ID: 5103290c-1e80-4095-97d6-da034ec032ef
:END:
:LOGBOOK:
CLOCK: [2022-05-07 Sat 10:53]--[2022-05-07 Sat 10:55] =>  0:02
CLOCK: [2022-05-07 Sat 10:42]--[2022-05-07 Sat 10:47] =>  0:05
CLOCK: [2022-05-07 Sat 10:29]--[2022-05-07 Sat 10:42] =>  0:13
:END:
* TODO 项目视图功能：添加子节点(按键+)
:PROPERTIES:
:ID:       2a2e5d40-4cba-4a97-9adf-3b374c09f2ce
:PARENT_ID: 5103290c-1e80-4095-97d6-da034ec032ef
:END:
- 给todo文件中任务添加子任务时，自动升级为项目，移动到project文件中
* DONE 买大小适合的床单
CLOSED: [2022-05-09 Mon 14:48]
:PROPERTIES:
:ID:       feff2cc6-f7dd-498f-9afa-19492765cfba
:END:
* TODO 看代码，熟悉常用的API和工具函数
:PROPERTIES:
:ID:       f2524153-b13a-49d4-88c6-5bcf9ea370a1
:PARENT_ID: 2595c172-46a7-43ea-aaa4-dca146571f57
:END:
* DONE 项目视图功能：显示单独项目结构
CLOSED: [2022-05-07 Sat 15:46]
:PROPERTIES:
:ID:       4c5e05d3-8600-4de4-b0e9-0a3f44c6f656
:PARENT_ID: 5103290c-1e80-4095-97d6-da034ec032ef
:END:
:LOGBOOK:
CLOCK: [2022-05-07 Sat 14:54]--[2022-05-07 Sat 15:46] =>  0:52
CLOCK: [2022-05-07 Sat 14:45]--[2022-05-07 Sat 14:50] =>  0:05
:END:
* NEXT 学习ewoc源码，了解本质
:PROPERTIES:
:ID:       734ab9c8-1dc7-48c7-835f-88ac1f717c0b
:END:
:LOGBOOK:
CLOCK: [2022-05-07 Sat 16:59]--[2022-05-07 Sat 17:12] =>  0:13
:END:
